In [2]:
from dotenv import load_dotenv
import os
load_dotenv()

True

In [3]:
import sqlite3
import pandas as pd
path_db = os.getenv('DB_PATH')

conn = sqlite3.connect(path_db)
df = pd.read_sql_query("SELECT * FROM ventas", conn)
conn.close()

In [13]:
df.dtypes

id                  int64
Year              float64
Month              object
Customer           object
Product            object
Units_Sold        float64
Price_per_Unit    float64
Revenue           float64
Customer_Name      object
dtype: object

In [14]:
df['Month'].unique()

array(['Jan', None, 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec'], dtype=object)

In [15]:
df.duplicated().sum()

np.int64(0)

In [16]:
df.isnull().sum().sum()

np.int64(4406)

In [17]:
df.count()

id                5478
Year              4920
Month             4930
Customer          4930
Product           4933
Units_Sold        4930
Price_per_Unit    4922
Revenue           4924
Customer_Name     4929
dtype: int64

In [18]:
df_limpio = df.copy()

    # 1. Eliminar duplicados
df_limpio = df_limpio.drop_duplicates()

# 2. Eliminar valores nulos
df_limpio = df_limpio.dropna()

# 3. Eliminar valores atÃ­picos
for col in ["Units_Sold", "Revenue"]:
    Q1 = df_limpio[col].quantile(0.25)
    Q3 = df_limpio[col].quantile(0.75)
    IQR = Q3 - Q1
    lim_inf = Q1 - 1.5 * IQR
    lim_sup = Q3 + 1.5 * IQR
    df_limpio = df_limpio[(df_limpio[col] >= lim_inf) & (df_limpio[col] <= lim_sup)]

In [19]:
df_limpio.count()

id                2163
Year              2163
Month             2163
Customer          2163
Product           2163
Units_Sold        2163
Price_per_Unit    2163
Revenue           2163
Customer_Name     2163
dtype: int64

In [4]:
df.head()

,id,Year,Month,Customer,Product,Units_Sold,Price_per_Unit,Revenue,Customer_Name
0,1,2019.0,Jan,Customer 103,Product D,93.0,22.426305,2085.646368,None
1,2,2019.0,Jan,Customer 72,Product E,21.0,19.821771,NaN,None
2,3,2019.0,Jan,Customer 467,Product C,75.0,87.286734,6546.505039,Hannah Harris
3,4,2019.0,Jan,Customer 100,Product C,2200.0,10.359100,227.900200,None
4,5,2019.0,Jan,Customer 344,Product D,30.0,NaN,755.166465,Rachel Brown

In [27]:
df_product =  df[['Product']]

In [54]:
df_customer = df[['Customer', 'Customer_Name']]

In [55]:
df_customer = df_customer.drop_duplicates()

In [56]:
# Eliminar nulos
df_customer = df_customer.dropna()

In [57]:
# Eliminar la palabra "Customer"
df_customer['Customer'] = df_customer['Customer'].str.replace('Customer', '')

In [58]:
df_customer

     Customer   Customer_Name
2         467   Hannah Harris
4         344    Rachel Brown
9         131   Matthew White
10        329  Rachel Jackson
11         14      Jane White
...       ...             ...
5462      258  Megan Thompson
5463      385     John Taylor
5467       95    Jane Jshnson
5473      249     Emily Jones
5477       26   Hagnah Garcia

[4149 rows x 2 columns]

In [59]:
# Agrupar por 'Customer' y tomar el primer valor de 'Customer_Name'
df_customer = df_customer.groupby('Customer').first().reset_index()

In [60]:
df_customer

    Customer     Customer_Name
0          1    Jamms Williams
1         10       Chris Mooae
2        100       Jane Wglson
3        101     Daniel Miller
4        102     Matthew Moore
..       ...               ...
495       95  Michael Williams
496       96      David Wilson
497       97     Joseph Miller
498       98      Emaly Martin
499       99   Michael Johnson

[500 rows x 2 columns]

In [61]:
# Agregar un aleatorio de gÃ©nero entre 'M' y 'F' a customer
import random
df_customer['Gender'] = [random.choice(['M', 'F']) for _ in range(len(df_customer))]

In [62]:
# Agregar un aleatorio de paÃ­s entre 'USA', 'Canada', 'Mexico' a customer
df_customer['Country'] = [random.choice(['USA', 'Canada', 'Mexico', 'Colombia']) for _ in range(len(df_customer))]

In [63]:
df_customer.columns

Index(['Customer', 'Customer_Name', 'Gender', 'Country'], dtype='object')

In [64]:
# Asignar fecha de nacimiento aleatoria entre 1958 y 2005
from datetime import datetime, timedelta
import random

def random_date(start, end):
    return start + timedelta(days=random.randint(0, (end - start).days))

start_date = datetime(1958, 1, 1)
end_date = datetime(2005, 1, 1)
df_customer['Birth_Date'] = [random_date(start_date, end_date).strftime('%Y-%m-%d') for _ in range(len(df_customer))]
df_customer

    Customer     Customer_Name Gender   Country  Birth_Date
0          1    Jamms Williams      M  Colombia  1963-09-04
1         10       Chris Mooae      M    Canada  1975-03-17
2        100       Jane Wglson      F       USA  1966-12-27
3        101     Daniel Miller      F    Mexico  1961-03-09
4        102     Matthew Moore      M    Canada  1995-12-23
..       ...               ...    ...       ...         ...
495       95  Michael Williams      M    Mexico  1994-03-14
496       96      David Wilson      F       USA  1988-06-07
497       97     Joseph Miller      F    Mexico  1982-05-27
498       98      Emaly Martin      F       USA  1959-06-23
499       99   Michael Johnson      F       USA  2003-07-20

[500 rows x 5 columns]

In [67]:
# Guardar en xlsx
df_customer.to_excel('./src/fuentesAdicionales/customer_information.xlsx', index=False)

In [28]:
# Eliminar Customer con Customer_Name None
df_product = df_product.dropna(subset=['Product'])

In [30]:
df_product = df_product.drop_duplicates()

In [31]:
df_product

      Product
0   Product D
1   Product E
2   Product C
7   Product B
14  Product A

(5, 1)

In [24]:
# Ordenar por 'Customer_Name'
df_customer = df_customer.sort_values(by='Customer_Name')

In [15]:
# Eliminar duplicados
df_customer = df_customer.drop_duplicates(subset=['Customer_Name'])

In [25]:
df_customer.head(50)

          Customer    Customer_Name
3969  Customer 201   Ajdrew Johnson
3728  Customer 166    Anarew Garcia
4185  Customer 192     Ancrew Jones
414    Customer 22  Andbew Anderson
1761  Customer 166  Andcew Thompson
4707   Customer 77    Anddew Thomas
1325  Customer 389     Andhew White
3810   Customer 52     Andjew Brown
494   Customer 466    Andnew Miller
4070  Customer 457     Andrdw Moore
1393  Customer 357    Andrei Harris
2171  Customer 345     Andret Jones
3491   Customer 54  Andrew Aaderson
3034  Customer 263  Andrew Anderson
576   Customer 253  Andrew Anderson
3177  Customer 475  Andrew Anderson
350   Customer 183  Andrew Anderson
2714   Customer 29  Andrew Anderson
2978   Customer 52  Andrew Ankerson
2446  Customer 234     Andrew Brown
105    Customer 58     Andrew Brown
4405   Customer 26     Andrew Brown
1802   Customer 25     Andrew Brown
318   Customer 362     Andrew Brown
2622  Customer 120     Andrew Davis
3327  Customer 362     Andrew Davis
4271  Customer 320     Andrew Davis
3127  Customer 362     Andrew Davis
4406  Customer 292     Andrew Davis
5134   Customer 44     Andrew Davis
3979   Customer 92     Andrew Davis
1050  Customer 493     Andrew Davis
1722  Customer 298     Andrew Davis
3338  Customer 140     Andrew Davis
4187  Customer 317     Andrew Davis
4731  Customer 297     Andrew Davis
1740   Customer 82     Andrew Dkvis
3223  Customer 459    Andrew Garcia
1866  Customer 441    Andrew Garcia
3354  Customer 185    Andrew Garcia
3252  Customer 376    Andrew Garcia
2379  Customer 110    Andrew Garcia
3818  Customer 283    Andrew Garciq
3074  Customer 165    Andrew Harris
2179  Customer 278    Andrew Harris
4710   Customer 50    Andrew Harris
306    Customer 11    Andrew Harris
4714   Customer 89    Andrew Harris
5432  Customer 357    Andrew Harris
4584  Customer 314    Andrew Harris